Repository: Daniel-Kirchhoff/cowculus
Catalog: lib/l10n/app_*.arb
Languages: de

source: System Language
de: Systemsprache

# calculatorTitle
source: Calf Pen Calculator
de: Kälberplatz Kalkulator

# welcomeHeadline
source: Welcome to cowculus!
de: Willkommen bei cowculus!

# welcomeSubtitle
source: This app is based on the master’s thesis by Maren Thiemann and brings her calculation tool for determining the need for individual calf pens into practice. Designed for dairy farmers and advisors, it helps you calculate your specific space requirements and identify opportunities to improve calf housing management.
de: Diese App basiert auf der Masterarbeit von Maren Thiemann und setzt ihr Kalkulationstool zur Bedarfsbestimmung von Einzelplätzen für Kälber in der Praxis um. Entwickelt für Milchviehhalter und Berater, unterstützt sie Sie dabei, den individuellen Platzbedarf zu berechnen und Optimierungspotenziale im Management der Kälberhaltung zu erkennen.

# splashExplanation
source: This app helps you determine the required number of calf pens for your farm.
de: Diese App hilft Ihnen bei der Ermittlung des Bedarfs an Kälberplätzen für Ihren landwirtschaftlichen Betrieb.

# masterThesisCredit
source: Developed as part of the master's thesis by M. Thiemann, FH Südwestfalen.
de: Entwickelt im Rahmen der Masterarbeit von M. Thiemann, FH Südwestfalen.

# skipSplashCheckboxLabel
source: Skip this page next time
de: Startseite beim nächsten Mal überspringen

# startCalculatorButton
source: Start Calculator
de: Rechner starten

# mainParameterFormTitle
source: Enter Farm-Specific Parameters:
de: Betriebsindividuelle Parameter eingeben:

# resultsTitle
source: Results of Calf Pen Calculation:
de: Ergebnisse der Kälberplatzberechnung:

# panelTitleTierzahlen
source: Animal Numbers
de: Tierzahlen

# panelTitleGeschlecht
source: Sex Distribution
de: Geschlechterverteilung

# panelTitleZeit
source: Time Parameters
de: Zeitparameter

# panelTitleReproduktion
source: Reproduction & Health Parameters
de: Reproduktions- & Gesundheitsparameter

# columnHeaderAktuell
source: Current (farm-specific)
de: Aktuell (betriebsspez.)

# columnHeaderRealistisch
source: Realistic (Avg. NRW/DE, +25% Res.)
de: Realistisch (Ø NRW/DE, +25% Res.)

# columnHeaderEmpfehlung
source: Recommendation (Consulting)
de: Empfehlung (Beratung)

# rowLabelBullenkaelber
source: Bull Calf Pens
de: Bullenkälber-Plätze

# rowLabelFaersenkaelber
source: Heifer Calf Pens
de: Färsenkälber-Plätze

# rowLabelGesamtPlaetze
source: Total Pens
de: Gesamt-Plätze

# buttonTextBerechnen
source: Calculate
de: Berechnen

# hinweisTextTabelle
source: * Note: 'Realistic' includes a 25% reserve on total pens. 'Bull calf' and 'Heifer calf pens' are shown without this scenario-specific reserve.
de: * Hinweis: 'Realistisch' beinhaltet 25% Reserve auf die Gesamtplätze. 'Bullenkälber-' und 'Färsenkälber-Plätze' werden ohne diese szenariospezifische Reserve ausgewiesen.

# textFieldHint
source: Enter value
de: Wert eingeben

# validatorMsgBitteWertEingeben
source: Please enter a value
de: Bitte Wert eingeben

# validatorMsgUngueltigeZahl
source: Invalid number
de: Ungültige Zahl

# validatorMsgWertMussPositivSein
source: Value must be positive
de: Wert muss positiv sein

# einheitStueck
source: pcs.
de: Stk.

# einheitTage
source: days
de: Tage

# textFormFieldLabelAnzahlMilchkuehe
source: Number of Dairy Cows
de: Anzahl Milchkühe

# textFormFieldLabelAnzahlFaersen
source: Number of Heifers for Calving (per year)
de: Anzahl Färsen zur Abkalbung (pro Jahr)

# textFormFieldLabelAnteilMaennlKaelber
source: Percentage of Male Calves
de: Anteil männlicher Kälber

# textFormFieldLabelZwischenkalbezeit
source: Inter-Calving Interval
de: Zwischenkalbezeit

# textFormFieldLabelHaltedauerBullen
source: Housing Duration Bull Calves (single)
de: Haltedauer Bullenkälber (Einzelhaltung)

# textFormFieldLabelHaltedauerFaersen
source: Housing Duration Heifer Calves (single)
de: Haltedauer Färsenkälber (Einzelhaltung)

# textFormFieldLabelLeerstandszeit
source: Vacancy Period Between Occupancies
de: Leerstandszeit zwischen Belegungen

# textFormFieldLabelAbkalberate
source: Calving Rate
de: Abkalberate

# textFormFieldLabelFruehmortalitaet
source: Early Mortality (calves up to 28 days)
de: Frühmortalität (Kälber bis 28 Tage)

# textFormFieldLabelTotgeburtenrate
source: Stillbirth Rate (optional)
de: Totgeburtenrate (optional)

# textFormFieldLabelZwillingstraechtigkeiten
source: Twin Pregnancy Rate
de: Anteil Zwillingsträchtigkeiten

# tooltipAnzahlMilchkuehe
source: Enter the average number of lactating cows in your herd.
de: Geben Sie die durchschnittliche Anzahl der laktierenden Kühe in Ihrer Herde an.

# tooltipAnzahlFaersen
source: Enter the number of heifers expected to calve for the first time in the coming year.
de: Geben Sie die Anzahl der Färsen an, die voraussichtlich im kommenden Jahr zum ersten Mal kalben werden.

# tooltipAnteilMaennlKaelber
source: The percentage of born calves that are male. Usually around 50%.
de: Der prozentuale Anteil der geborenen Kälber, die männlich sind. Üblicherweise um die 50%.

# tooltipZwischenkalbezeit
source: The average number of days between two consecutive calvings of a cow.
de: Die durchschnittliche Anzahl der Tage zwischen zwei aufeinanderfolgenden Kalbungen einer Kuh.

# tooltipHaltedauerBullen
source: The average number of days a bull calf remains in a single hutch or calf box after birth.
de: Die durchschnittliche Anzahl der Tage, die ein Bullenkalb nach der Geburt im Einzel-Iglu oder in der Kälberbox verbleibt.

# tooltipHaltedauerFaersen
source: The average number of days a heifer calf remains in a single hutch or calf box after birth.
de: Die durchschnittliche Anzahl der Tage, die ein Färsenkalb nach der Geburt im Einzel-Iglu oder in der Kälberbox verbleibt.

# tooltipLeerstandszeit
source: The number of days a box or hutch remains empty after a calf is moved out before it is reoccupied (for cleaning and disinfection).
de: Die Anzahl der Tage, die eine Box oder ein Iglu nach dem Ausstallen eines Kalbes leer steht, bevor es neu belegt wird (für Reinigung und Desinfektion).

# tooltipAbkalberate
source: The percentage of cows and heifers intended for calving that actually calve per year.
de: Der prozentuale Anteil der Kühe und zur Abkalbung vorgesehenen Färsen, die pro Jahr tatsächlich kalben.

# tooltipFruehmortalitaet
source: The percentage of calves that die within the first 28 days of life.
de: Der prozentuale Anteil der Kälber, die in den ersten 28 Lebenstagen verenden.

# tooltipTotgeburtenrate
source: Optional: The percentage of calves that are stillborn or die within the first 24 hours.
de: Optional: Der prozentuale Anteil der Kälber, die tot geboren werden oder innerhalb der ersten 24 Stunden verenden.

# tooltipZwillingstraechtigkeiten
source: The percentage of pregnancies that result in twin births.
de: Der prozentuale Anteil der Trächtigkeiten, die zu Zwillingsgeburten führen.

# resultsPlaceholder
source: Enter your data and click 'Calculate' to display the results here.
de: Geben Sie Ihre Daten ein und klicken Sie auf 'Berechnen', um die Ergebnisse hier anzuzeigen.

# chartTitle
source: Graphical Analysis
de: Grafische Auswertung

# buttonTextPdfExport
source: Export PDF
de: PDF exportieren

# pdfErrorNoResults
source: No results to export. Please calculate first.
de: Keine Ergebnisse zum Exportieren vorhanden. Bitte zuerst berechnen.

# pdfGenerating
source: Generating PDF...
de: PDF wird erstellt...

# pdfErrorGeneral
source: Error creating PDF
de: Fehler beim Erstellen des PDF

# pdfGeneratedOn
source: Generated on:
de: Erstellt am:

# helpButtonTooltip
source: Help & Information
de: Hilfe & Information

# helpDialogAboutTitle
source: About cowculus
de: Über cowculus

# helpDialogAboutText
source: This app is based on the master's thesis by Maren Thiemann and brings her calculation tool for determining the need for individual calf pens into practice. It helps dairy farmers and advisors calculate individual space requirements and identify optimization opportunities in calf housing management.
de: Diese App basiert auf der Masterarbeit von Maren Thiemann und setzt ihr Kalkulationstool zur Bedarfsbestimmung von Einzelplätzen für Kälber in der Praxis um. Sie hilft Milchviehhaltern und Beratern dabei, den individuellen Platzbedarf zu berechnen und Optimierungspotenziale im Management der Kälberhaltung zu erkennen.

# helpDialogUsageTitle
source: How to Use
de: Bedienung

# helpDialogUsageText
source: 1. Enter your farm-specific parameters in the input fields 2. Click 'Calculate' 3. View the results in the table and chart 4. Use the three scenarios for different planning approaches
de: 1. Geben Sie Ihre betriebsindividuellen Parameter in die Eingabefelder ein 2. Klicken Sie auf 'Berechnen'

# helpDialogScenariosTitle
source: Scenarios
de: Szenarien

# helpDialogScenariosText
source: • Current: Based on your entered farm-specific values • Realistic: Uses average values from NRW/Germany with 25% safety reserve • Recommendation: Offers optimized recommendation values for consulting
de: • Aktuell: Basiert auf Ihren eingegebenen betriebsspezifischen Werten • Realistisch: Verwendet Durchschnittswerte aus NRW/Deutschland mit 25% Sicherheitsreserve • Empfehlung: Bietet optimierte Empfehlungswerte für die Beratung

# helpDialogCloseButton
source: Close
de: Schließen

# programmerInfo
source: Developed by Daniel Kirchhoff • App development and technical implementation • Contact: info@danielkirchhoff.de
de: Entwickelt von Daniel Kirchhoff • App-Entwicklung und technische Umsetzung • Kontakt: info@danielkirchhoff.de
